STMicroelectronics/STM32CubeWB/Drivers/BSP/STM32WB5MM-DK/stm32wb5mm_dk_audio.c
  /* This function is called when an Interrupt due to transfer error on or peripheral
  error occurs. */
}

/**
  * @}
  */ 
  
/** @defgroup BSP_AUDIO_IN_Private_Functions STM32WB5MM_DK AUDIO IN Private Functions
  * @{
  */ 

/*******************************************************************************
Static Functions
*******************************************************************************/

/**
  * @brief AUDIO IN SAI MSP Init
  * @param hsai SAI handle
  * @retval None
  */
static void SAI_MspInit(SAI_HandleTypeDef *hsai)
{
  static DMA_HandleTypeDef hSaiDma;
  
  GPIO_InitTypeDef  GPIO_InitStruct;
  
  /* Enable the SAI peripheral clock */
  AUDIO_IN_SAI_CLK_ENABLE();  
  /* Enable SAI GPIO clocks */
  AUDIO_IN_SAI_SCK_GPIO_CLK_ENABLE();
  AUDIO_IN_SAI_SD2_GPIO_CLK_ENABLE();  
  
  /* SAI pins configuration: SCK and SD pins ------------------------------*/
  GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull      = GPIO_NOPULL;
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  
  GPIO_InitStruct.Pin       = AUDIO_IN_SAI_SCK_PIN;
  GPIO_InitStruct.Alternate = AUDIO_IN_SAI_SCK_AF;
  HAL_GPIO_Init(AUDIO_IN_SAI_SCK_GPIO_PORT, &GPIO_InitStruct);
  
  GPIO_InitStruct.Pull      = GPIO_PULLUP;
  GPIO_InitStruct.Pin       = AUDIO_IN_SAI_SD2_PIN ;
  GPIO_InitStruct.Alternate = AUDIO_IN_SAI_SD2_AF;
  HAL_GPIO_Init(AUDIO_IN_SAI_SD2_GPIO_PORT, &GPIO_InitStruct);
  
  /* Enable the DMA clock */
  /* DMA controller clock enable */
  __HAL_RCC_DMAMUX1_CLK_ENABLE();
  __HAL_RCC_DMA1_CLK_ENABLE();  
  
  /* Configure the hSaiDma handle parameters */
  hSaiDma.Instance                 = DMA1_Channel1;
  hSaiDma.Init.Request             = DMA_REQUEST_SAI1_A;
  hSaiDma.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  hSaiDma.Init.PeriphInc           = DMA_PINC_DISABLE;
  hSaiDma.Init.MemInc              = DMA_MINC_ENABLE;
  hSaiDma.Init.PeriphDataAlignment = AUDIO_IN_SAI_DMAx_PERIPH_DATA_SIZE;
  hSaiDma.Init.MemDataAlignment    = AUDIO_IN_SAI_DMAx_MEM_DATA_SIZE;
  hSaiDma.Init.Mode                = DMA_CIRCULAR;
  hSaiDma.Init.Priority            = DMA_PRIORITY_HIGH;
  
  /* Associate the DMA handle */
  __HAL_LINKDMA(hsai, hdmarx, hSaiDma);    
  /* Deinitialize the Stream for new transfer */
  (void)HAL_DMA_DeInit(&hSaiDma);    
  /* Configure the DMA Stream */
  (void)HAL_DMA_Init(&hSaiDma);
  
  /* SAI DMA IRQ Channel configuration */
  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, BSP_AUDIO_IN_IT_PRIORITY, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
}

/**
  * @brief  Clock Config.
  * @param  hsai SAI handle if required
  * @note   This API is called by BSP_AUDIO_IN_Init()
  *         Being __weak it can be overwritten by the application
  * @retval HAL_OK if no problem during execution, HAL_ERROR otherwise
  */
__weak HAL_StatusTypeDef MX_SAI_ClockConfig(SAI_HandleTypeDef *hsai)
{
  HAL_StatusTypeDef ret = HAL_OK;
  RCC_PeriphCLKInitTypeDef  PeriphClkInitStruct;

  if (AudioInCtx[0].SampleRate == 16000U)
  {
    PeriphClkInitStruct.PLLSAI1.PLLN = 82;
    PeriphClkInitStruct.PLLSAI1.PLLP = RCC_PLLP_DIV8;
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
    PeriphClkInitStruct.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_SAI1CLK;
    PeriphClkInitStruct.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLLSAI1;
  }
  else
  {
    PeriphClkInitStruct.PLLSAI1.PLLN = 86;
    PeriphClkInitStruct.PLLSAI1.PLLP = RCC_PLLP_DIV7;
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_SAI1;
    PeriphClkInitStruct.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_SAI1CLK;
    PeriphClkInitStruct.Sai1ClockSelection = RCC_SAI1CLKSOURCE_PLLSAI1;
  }
  if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) while(1);
  /* SAI1 clock enable */
  __HAL_RCC_SAI1_CLK_ENABLE(); 
  return ret;
}

/**
  * @brief  Initializes the audio in instance (SAI).
  * @param  hsai SAI handle
  * @param  PDM_FREQ PDM frequency
  * @note   Being __weak it can be overwritten by the application
  * @retval HAL status
  */
__weak HAL_StatusTypeDef MX_SAI1_Block_A_Init(SAI_HandleTypeDef* hsai,uint32_t PDM_FREQ)
{
  HAL_StatusTypeDef ret = HAL_OK;

  __HAL_SAI_DISABLE(hsai);

  hsai->Init.Protocol = SAI_FREE_PROTOCOL;
  hsai->Init.AudioMode = SAI_MODEMASTER_RX;
  hsai->Init.DataSize = SAI_DATASIZE_32;
  hsai->Init.FirstBit = SAI_FIRSTBIT_MSB;
  hsai->Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;
  hsai->Init.Synchro = SAI_ASYNCHRONOUS;
  hsai->Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
  hsai->Init.NoDivider = SAI_MASTERDIVIDER_DISABLE;
  hsai->Init.MckOverSampling = SAI_MCK_OVERSAMPLING_DISABLE;
  hsai->Init.FIFOThreshold = SAI_FIFOTHRESHOLD_EMPTY;
  hsai->Init.SynchroExt = SAI_SYNCEXT_DISABLE;
  hsai->Init.MonoStereoMode = SAI_STEREOMODE;
  hsai->Init.CompandingMode = SAI_NOCOMPANDING;
  hsai->Init.PdmInit.Activation = ENABLE;
  hsai->Init.PdmInit.ClockEnable = SAI_PDM_CLOCK2_ENABLE;
  hsai->FrameInit.FrameLength = 32;
  hsai->Init.PdmInit.MicPairsNbr = 2;
  hsai->Init.AudioFrequency = ((PDM_FREQ * 1000U) / hsai->FrameInit.FrameLength ) * 4U;
  hsai->FrameInit.ActiveFrameLength = 1;
  hsai->FrameInit.FSDefinition = SAI_FS_STARTFRAME;
  hsai->FrameInit.FSPolarity = SAI_FS_ACTIVE_HIGH;
  hsai->FrameInit.FSOffset = SAI_FS_FIRSTBIT;
  hsai->SlotInit.FirstBitOffset = 0;
  hsai->SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
  hsai->SlotInit.SlotNumber = 4;
  hsai->SlotInit.SlotActive = 0x00000002;

  if (HAL_SAI_Init(hsai) != HAL_OK)
  {
    return HAL_ERROR;
  }

  return ret;
}

/**
  * @}
  */ 

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
